; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 869503 1 1 2 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(have_image Planet5 infrared1)
	(have_image Star6 infrared1)
	(have_image Phenomenon7 infrared0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared1)
	(have_image Planet10 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 7
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 7
4. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   goals met: 0 of 7
5. (take_image satellite0 star6 instrument0 infrared1)
   added: (have_image star6 infrared1)
   goals met: 1 of 7
6. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 1 of 7
7. (take_image satellite0 planet9 instrument0 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 2 of 7
8. (turn_to satellite0 planet5 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet5)
   goals met: 2 of 7
9. (take_image satellite0 planet5 instrument0 infrared1)
   added: (have_image planet5 infrared1)
   goals met: 3 of 7
10. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 7
11. (take_image satellite0 planet10 instrument0 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 4 of 7
12. (turn_to satellite0 phenomenon7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 7
13. (take_image satellite0 phenomenon7 instrument0 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 5 of 7
14. (turn_to satellite0 groundstation2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation2)
   goals met: 6 of 7
15. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 5 of 7
16. (take_image satellite0 phenomenon8 instrument0 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 6 of 7
17. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 7 of 7
